Resources/schemas/Wsdl/SAP_Document_and_Reporting_Compliance-_Electronic_Documents_for_Mexico - eDocMexico_External.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions targetNamespace="http://www.sap.com/eDocument/Mexico/CFDI/v1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://www.sap.com/eDocument/Mexico/CFDI/v1.0" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:n1="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns:n2="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI">
 <wsdl:documentation>
  <sidl:sidl xmlns:sidl="http://www.sap.com/2007/03/sidl"/>
 </wsdl:documentation>
 <wsp:UsingPolicy wsdl:required="true"/>
 <wsp:Policy wsu:Id="IF_IF_eDocMexicoCFDI">
  <sapsession:Session xmlns:sapsession="http://www.sap.com/webas/630/soap/features/session/">
   <sapsession:enableSession>false</sapsession:enableSession>
  </sapsession:Session>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_CancelEdoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_SubmitEdoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_GetStatusEdoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsp:Policy wsu:Id="OP_IF_OP_GetViewEdoc">
  <sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit>
  <sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking>
  <saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required>
  <saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM>
 </wsp:Policy>
 <wsdl:types>
  <xsd:schema targetNamespace="http://www.sap.com/eDocument/Mexico/CFDI/v1.0" xmlns="http://www.sap.com/eDocument/Mexico/CFDI/v1.0" xmlns:xi0="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns:xi1="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI">
   <xsd:import namespace="http://www.sat.gob.mx/TimbreFiscalDigital"/>
   <xsd:element name="eDocFolioResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="eDocFolioResult" minOccurs="0" form="qualified">
       <xsd:complexType>
        <xsd:sequence>
         <xsd:element name="Folios" minOccurs="0" form="qualified" maxOccurs="unbounded">
          <xsd:complexType>
           <xsd:sequence>
            <xsd:element name="UUID" form="qualified" type="xsd:string"/>
            <xsd:element name="ResultStatus" form="qualified" type="xsd:double"/>
            <xsd:element name="ErrorCode" minOccurs="0" form="qualified" type="xsd:double"/>
            <xsd:element name="ErrorDescription" minOccurs="0" form="qualified" type="xsd:string"/>
            <xsd:element name="DocData" minOccurs="0" form="qualified" type="xsd:base64Binary"/>
           </xsd:sequence>
          </xsd:complexType>
         </xsd:element>
        </xsd:sequence>
        <xsd:attribute name="CodEstatus" type="xsd:string"/>
        <xsd:attribute name="Fecha" use="required">
         <xsd:simpleType>
          <xsd:restriction base="xsd:dateTime">
           <xsd:pattern value="[0-9]{4}-[0-9]{2}-[0-9]{2}T[0-9]{2}:[0-9]{2}:[0-9]{2}(.[0-9]{1,7})?Z"/>
          </xsd:restriction>
         </xsd:simpleType>
        </xsd:attribute>
        <xsd:attribute name="RfcEmisor" type="xsd:string"/>
       </xsd:complexType>
      </xsd:element>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="CancelEdocRequest">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="DocData" type="xsd:base64Binary"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="CancelEdocResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element ref="eDocFolioResponse"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="GetStatusEdocRequest" type="OperationRequestType"/>
   <xsd:element name="GetStatusEdocResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element ref="eDocFolioResponse"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="GetViewEdocRequest" type="OperationRequestType"/>
   <xsd:element name="GetViewEdocResponse">
    <xsd:complexType>
     <xsd:sequence>
      <xsd:element name="Document" type="xsd:base64Binary"/>
      <xsd:element name="Error" type="ErrorType"/>
     </xsd:sequence>
    </xsd:complexType>
   </xsd:element>
   <xsd:element name="SubmitEdocRequest" type="OperationRequestType"/>
   <xsd:element name="SubmitEdocResponse" type="OperationResponse"/>
   <xsd:complexType name="ErrorType">
    <xsd:sequence>
     <xsd:element name="ErrorCode" type="xsd:double"/>
     <xsd:element name="ErrorDescription" type="xsd:string"/>
    </xsd:sequence>
   </xsd:complexType>
   <xsd:complexType name="OperationRequestType">
    <xsd:sequence>
     <xsd:element name="DocData" type="xsd:base64Binary"/>
    </xsd:sequence>
   </xsd:complexType>
   <xsd:complexType name="OperationResponse">
    <xsd:sequence>
     <xsd:element name="SignedDocument" minOccurs="0" type="xsd:base64Binary"/>
     <xsd:element minOccurs="0" ref="xi0:TimbreFiscalDigital"/>
     <xsd:element name="ResultStatus" type="xsd:double"/>
     <xsd:element name="Error" minOccurs="0" type="ErrorType"/>
    </xsd:sequence>
   </xsd:complexType>
  </xsd:schema>
  <xsd:schema targetNamespace="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns:xi0="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns:xi1="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI">
   <xsd:import namespace="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI"/>
   <xsd:element name="TimbreFiscalDigital">
    <xsd:complexType>
     <xsd:attribute name="Version" use="required" type="xsd:anySimpleType"/>
     <xsd:attribute name="UUID" use="required">
      <xsd:simpleType>
       <xsd:restriction base="xsd:string">
        <xsd:length value="36"/>
        <xsd:pattern value="[a-f0-9A-F]{8}-[a-f0-9A-F]{4}-[a-f0-9A-F]{4}-[a-f0-9A-F]{4}-[a-f0-9A-F]{12}"/>
        <xsd:whiteSpace value="collapse"/>
       </xsd:restriction>
      </xsd:simpleType>
     </xsd:attribute>
     <xsd:attribute name="FechaTimbrado" use="required" type="xi1:t_FechaH"/>
     <xsd:attribute name="RfcProvCertif" use="required" type="xi1:t_RFC_PM"/>
     <xsd:attribute name="Leyenda">
      <xsd:simpleType>
       <xsd:restriction base="xsd:string">
        <xsd:maxLength value="150"/>
        <xsd:minLength value="12"/>
        <xsd:pattern value="([A-Z]|[a-z]|[0-9]| |Ñ|ñ|!|&quot;|%|&amp;|&apos;|´|-|:|;|&gt;|=|&lt;|@|_|,|\{|\}|`|~|á|é|í|ó|ú|Á|É|Í|Ó|Ú|ü|Ü){1,150}"/>
        <xsd:whiteSpace value="collapse"/>
       </xsd:restriction>
      </xsd:simpleType>
     </xsd:attribute>
     <xsd:attribute name="SelloCFD" use="required">
      <xsd:simpleType>
       <xsd:restriction base="xsd:string">
        <xsd:whiteSpace value="collapse"/>
       </xsd:restriction>
      </xsd:simpleType>
     </xsd:attribute>
     <xsd:attribute name="NoCertificadoSAT" use="required">
      <xsd:simpleType>
       <xsd:restriction base="xsd:string">
        <xsd:length value="20"/>
        <xsd:pattern value="[0-9]{20}"/>
        <xsd:whiteSpace value="collapse"/>
       </xsd:restriction>
      </xsd:simpleType>
     </xsd:attribute>
     <xsd:attribute name="SelloSAT" use="required">
      <xsd:simpleType>
       <xsd:restriction base="xsd:string">
        <xsd:whiteSpace value="collapse"/>
       </xsd:restriction>
      </xsd:simpleType>
     </xsd:attribute>
    </xsd:complexType>
   </xsd:element>
  </xsd:schema>
  <xsd:schema targetNamespace="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI" xmlns="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI" xmlns:xi0="http://www.sat.gob.mx/TimbreFiscalDigital" xmlns:xi1="http://www.sat.gob.mx/sitio_internet/cfd/tipoDatos/tdCFDI">
   <xsd:simpleType name="t_FechaH">
    <xsd:restriction base="xsd:dateTime">
     <xsd:pattern value="(20[1-9][0-9])-(0[1-9]|1[0-2])-(0[1-9]|[12][0-9]|3[01])T(([01][0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9])"/>
     <xsd:whiteSpace value="collapse"/>
    </xsd:restriction>
   </xsd:simpleType>
   <xsd:simpleType name="t_RFC_PM">
    <xsd:restriction base="xsd:string">
     <xsd:minLength value="12"/>
     <xsd:pattern value="[A-Z&amp;Ñ]{3}[0-9]{2}(0[1-9]|1[012])(0[1-9]|[12][0-9]|3[01])[A-Z0-9]{2}[0-9A]"/>
     <xsd:whiteSpace value="collapse"/>
    </xsd:restriction>
   </xsd:simpleType>
  </xsd:schema>
 </wsdl:types>
 <wsdl:message name="SubmitEdocRequest">
  <wsdl:part name="SubmitEdocRequest" element="tns:SubmitEdocRequest"/>
 </wsdl:message>
 <wsdl:message name="SubmitEdocResponse">
  <wsdl:part name="SubmitEdocResponse" element="tns:SubmitEdocResponse"/>
 </wsdl:message>
 <wsdl:message name="GetStatusEdocRequest">
  <wsdl:part name="GetStatusEdocRequest" element="tns:GetStatusEdocRequest"/>
 </wsdl:message>
 <wsdl:message name="GetStatusEdocResponse">
  <wsdl:part name="GetStatusEdocResponse" element="tns:GetStatusEdocResponse"/>
 </wsdl:message>
 <wsdl:message name="GetViewEdocRequest">
  <wsdl:part name="GetViewEdocRequest" element="tns:GetViewEdocRequest"/>
 </wsdl:message>
 <wsdl:message name="GetViewEdocResponse">
  <wsdl:part name="GetViewEdocResponse" element="tns:GetViewEdocResponse"/>
 </wsdl:message>
 <wsdl:message name="CancelEdocRequest">
  <wsdl:part name="CancelEdocRequest" element="tns:CancelEdocRequest"/>
 </wsdl:message>
 <wsdl:message name="CancelEdocResponse">
  <wsdl:part name="CancelEdocResponse" element="tns:CancelEdocResponse"/>
 </wsdl:message>
 <wsdl:portType name="eDocMexicoCFDI">
  <wsp:Policy>
   <wsp:PolicyReference URI="#IF_IF_eDocMexicoCFDI"/>
  </wsp:Policy>
  <wsdl:operation name="SubmitEdoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_SubmitEdoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:SubmitEdocRequest"/>
   <wsdl:output message="tns:SubmitEdocResponse"/>
  </wsdl:operation>
  <wsdl:operation name="GetStatusEdoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_GetStatusEdoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:GetStatusEdocRequest"/>
   <wsdl:output message="tns:GetStatusEdocResponse"/>
  </wsdl:operation>
  <wsdl:operation name="GetViewEdoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_GetViewEdoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:GetViewEdocRequest"/>
   <wsdl:output message="tns:GetViewEdocResponse"/>
  </wsdl:operation>
  <wsdl:operation name="CancelEdoc">
   <wsp:Policy>
    <wsp:PolicyReference URI="#OP_IF_OP_CancelEdoc"/>
   </wsp:Policy>
   <wsdl:input message="tns:CancelEdocRequest"/>
   <wsdl:output message="tns:CancelEdocResponse"/>
  </wsdl:operation>
 </wsdl:portType>
</wsdl:definitions>
